app/views/friends/index.html.erb

        <tr>
          <td><%= User.find(friendship.sent_by_id).email %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]