app/views/friend_requests/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <%if request.status.nil?%>
          <td><%= User.find(request.sent_by_id).email %></td>