app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["title", "user1"], ["body", "user1body"], ["user_id", nil], ["created_at", "2022-09-14 13:43:46.963396"], ["updated_at", "2022-09-14 13:43:46.963396"], ["status", "public"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def destroy
    @article = Article.find(params[:id])