app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "status", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "ritul_comments1"], ["body", "ritul_cbody1"], ["status", "public"], ["article_id", 1], ["created_at", "2022-09-14 14:09:31.350601"], ["updated_at", "2022-09-14 14:09:31.350601"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)