app/controllers/friends_controller.rb

  def index
    @friends = Friendship.all
---
SELECT "friendships".* FROM "friendships"