app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "shyam123@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-09-14 14:15:10.604399"], ["updated_at", "2022-09-14 14:15:10.604399"]]
---
  def create
    user = User.new(
      email:params[:email],
      password:params[:password],
      password_confirmation:params[:password_confrrmation]
    )
    if user.save